In [1]:
import pandas as pd
import numpy as np

### Data Load

In [2]:
data = pd.read_csv('./titanic/test.csv')
data.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

### Data Outline

In [3]:
#데이터의 크기
data.shape

(418, 11)

418개의 row, 11개의 칼럼

In [4]:
#데이터의 정보
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 418 entries, 0 to 417
Data columns (total 11 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  418 non-null    int64
 1   Pclass       418 non-null    int64
 2   Name         418 non-null    object
 3   Sex          418 non-null    object
 4   Age          332 non-null    float64
 5   SibSp        418 non-null    int64
 6   Parch        418 non-null    int64
 7   Ticket       418 non-null    object
 8   Fare         417 non-null    float64
 9   Cabin        91 non-null     object
 10  Embarked     418 non-null    object
dtypes: float64(2), int64(4), object(5)
memory usage: 36.0+ KB

In [5]:
#계략적인 데이터 분포도 확인
data.describe()

       PassengerId      Pclass         Age       SibSp       Parch        Fare
count   418.000000  418.000000  332.000000  418.000000  418.000000  417.000000
mean   1100.500000    2.265550   30.272590    0.447368    0.392344   35.627188
std     120.810458    0.841838   14.181209    0.896760    0.981429   55.907576
min     892.000000    1.000000    0.170000    0.000000    0.000000    0.000000
25%     996.250000    1.000000   21.000000    0.000000    0.000000    7.895800
50%    1100.500000    3.000000   27.000000    0.000000    0.000000   14.454200
75%    1204.750000    3.000000   39.000000    1.000000    0.000000   31.500000
max    1309.000000    3.000000   76.000000    8.000000    9.000000  512.329200

In [6]:
#value_counts(), 칼럼의 값이 어떠한 분포로 구성되어 있는지 살펴봄.
data['Pclass'].value_counts()

3    218
1    107
2     93
Name: Pclass, dtype: int64

DataFrame의 [] 연산자 내부에 칼럼 명을 입력하면 Series 형태로 특정 칼럼 데이터 세트가 반환 됩니다.</br>
이렇게 반환된 Series 객체에 value_counts() 매서드를 호출하면 해당 칼럼값의 유형과 건수를 확인할 수 있습니다.</br>
counts()는 지정된 칼럼의 데이터 값 변수를 반환합니다.

In [7]:
data_Pclass = data['Pclass']
print('Pclass 칼럼의 데이터 타입: ', type(data_Pclass))

Pclass 칼럼의 데이터 타입:  <class 'pandas.core.series.Series'>

### DataFrame과 리스트, 딕셔너리 넘파이 ndarray 상호 변환

DataFrame은 파이썬의 리스트, 딕셔너리 넘파이 ndarray 등 다양한 데이터로부터 생성될수 있고, 반대로 변환될 수도 있습니다.</br>
Sckitlearn의 API는 DataFrame을 인자로 입력 받을 수 있지만, 기본적으로 넘파이 ndarray를 인자로 사용하는 경우가 대부분입니다.

#### 리스트를 dataframe으로 변환하기

In [8]:
#리스트를 np 형태로 변환(1차원 데이터)
col_name1 = ['col1']
list1 = ['a', 'b', 'c']
arr1 = np.array(list1)

In [9]:
# 리스트를 dataframe으로 변환
df_list = pd.DataFrame(list1,
                       columns = col_name1)
print('1차원 리스트로 만든 dataframe: \n', df_list)

df_arr = pd.DataFrame(arr1,
                    columns = col_name1)
print('\n1차원 ndarray로 만든 dataframe: \n', df_list)

1차원 리스트로 만든 dataframe:
   col1
0    a
1    b
2    c

1차원 ndarray로 만든 dataframe:
   col1
0    a
1    b
2    c

In [10]:
#리스트를 np 형태로 변환(2차원 데이터)
#2행 3열 형태의 리스트와 ndarray 3개의 칼럼명이 필요
col_name2 = ['col1', 'col2', 'col3']
list2 = [['a', 'b', 'c'],
        ['d', 'e', 'f']]
arr2 = np.array(list2)

In [11]:
# 리스트를 dataframe으로 변환
df_list2 = pd.DataFrame(list2,
                       columns = col_name2)
print('1차원 리스트로 만든 dataframe: \n', df_list2)

df_arr2 = pd.DataFrame(arr2,
                       columns = col_name2)
print('\n2차원 ndarray로 만든 dataframe: \n', df_list2)

1차원 리스트로 만든 dataframe:
   col1 col2 col3
0    a    b    c
1    d    e    f

2차원 ndarray로 만든 dataframe:
   col1 col2 col3
0    a    b    c
1    d    e    f

In [12]:
# 딕셔너리를 dataframe으로 변환.
dict = {'col1': [1, 11], 'col2': [2, 22], 'col3': [3,33]}
df_dict = pd.DataFrame(dict)
print('딕셔너리로 만든 DataFrame:\n', df_dict)

딕셔너리로 만든 DataFrame:
    col1  col2  col3
0     1     2     3
1    11    22    33

#### dataframe을 ndarray, 리스트, 딕셔너리로 변환하기

In [13]:
#dataframedmf ndarray로 변환
arr3 = df_dict.values
print('df_dict.values 타입:', type(arr3), '\ndf_dict.values shape:', arr3.shape, '\n',arr3)

df_dict.values 타입: <class 'numpy.ndarray'>
df_dict.values shape: (2, 3)
 [[ 1  2  3]
 [11 22 33]]

In [14]:
#dataframe을 리스트로 변환
list3 = df_dict.values.tolist()
print('df_dict.values.tolist() 타입:', type(list3))
print(list3)

df_dict.values.tolist() 타입: <class 'list'>
[[1, 2, 3], [11, 22, 33]]

In [15]:
#dataframe을 딕셔너리로 변환
dict3 = df_dict.to_dict('list')
print('df_dict.to_dict() 타입:', type(dict3))
print(dict3)

df_dict.to_dict() 타입: <class 'dict'>
{'col1': [1, 11], 'col2': [2, 22], 'col3': [3, 33]}

### DataFrame의 칼럼 데이터 생성과 수정

In [16]:
#dataframe의 칼럼 데이터 생성
data['day'] = 0
data.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,day
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q,0
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S,0
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q,0
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S,0
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S,0

In [17]:
#dataframe의 칼럼 데이터 삭제
data_drop_day = data.drop('day', axis = 1)
data_drop_day.head(3)

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q

데이터 삭제 - drop 메서드</br>
drop 메서드의 원형:</br>
drop(labels= None, axis= 0, index= None, columns= None, level= None, inplace= False, errors= 'raise')</br>
</br>
labels: 드롭할 칼럼명을 입력</br>
axis: axis 값에 따라 칼럼 또는 행을 드롭, axis= 0은 row, axis= 1은 column 방향</br>
inplace: inplace= False 자기 자신의 dataframe의 데이터는 삭제하지 않음, inplace= True 자신의 dataframe을 삭제함.</br>

In [18]:
# 칼럼 삭제.
data.drop('day',axis= 1, inplace= True)
data.head(3)

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q

In [19]:
# dataframe의 row 삭제
print('### before axis 0 drop ###')
print(data_drop_day.head(3))
print('\n### after axis 0 drop ###')
data_drop_day.drop([0,1,2], axis= 0,inplace= True)
print(data_drop_day.head(3))

### before axis 0 drop ###
   PassengerId  Pclass                              Name     Sex   Age  SibSp  \
0          892       3                  Kelly, Mr. James    male  34.5      0
1          893       3  Wilkes, Mrs. James (Ellen Needs)  female  47.0      1
2          894       2         Myles, Mr. Thomas Francis    male  62.0      0

   Parch  Ticket    Fare Cabin Embarked
0      0  330911  7.8292   NaN        Q
1      0  363272  7.0000   NaN        S
2      0  240276  9.6875   NaN        Q

### after axis 0 drop ###
   PassengerId  Pclass                                          Name     Sex  \
3          895       3                              Wirz, Mr. Albert    male
4          896       3  Hirvonen, Mrs. Alexander (Helga E Lindqvist)  female
5          897       3                    Svensson, Mr. Johan Cervin    male

    Age  SibSp  Parch   Ticket     Fare Cabin Embarked
3  27.0      0      0   315154   8.6625   NaN        S
4  22.0      1      1  3101298  12.2875   NaN        S
5  14.0      0      0     7538   9.2250   NaN        S